#ifndef __BDCMODEL_H_
#define __BDCMODEL_H_
	//-------Цифровые параметры БУС----------------//
	//16 разрядов 2поток
	ushort BDC_USER_DATA_18[]={
		65535,65535,65535,1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,0,
		65535,65535,65535,1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,0
	};
	ushort BDC_SERVICE_DATA_18[]={
		65024,65024,65024,65535,49152,49663,49663,
		49663,49663,49663,49663,49663,49663,
		49663,49663,49663,49663,49663,49663,65024,
		65024,65024,65024,65535,49152,49663,49663,
		49663,49663,49663,49663,49663,49663,
		49663,49663,49663,49663,49663,49663,65024
	};
	//15 разрядов 1 поток
	ushort BDC_USER_DATA_16[]={
		0x7FFF,0x7FFF,0x7FFF,0x8001,0x8002,0x8004,0x8008,0x8010,0x8020,0x8040,
		0x8080,0x8100,0x8200,0x8400,0x8800,0x9000,0xA000,0xC000,0x8001,0,
		0x7FFF,0x7FFF,0x7FFF,0x8001,0x8002,0x8004,0x8008,0x8010,0x8020,0x8040,
		0x8080,0x8100,0x8200,0x8400,0x8800,0x9000,0xA000,0xC000,0x8001,0,
	};

	//----Аналоговые параметры БУС-------------------
	ushort ANALOG_BDC[46]={
		//РМ1
		100,100,100,100,  //2 42 82 122
		//РМ2
		200,200,200,200,  //3 43 83 123
		//РМ3
		300,300,300,300,  //4 44 84	124
		//РМ4
		400,400,400,400,  //5 45 85 125
		//ШТ1
		500,500,500,500,  //6 46 86 126
		//ШТ2
		105,105,105,105,  //12 52 92 132 
		//ШТ3
		205,205,205,205,  //13 53 93 133
		//ШТ4
		305,305,305,305,  //7 47 87 127
		//АВ
		405,405,		  //8 88
		//+9В			  
		505,505,		  //48 128
		//-9В
		110,110,		  //9 89 
		//ЦАП1			  
		220,220,		  //49 129
		//ЦАП2
		330,330,		  //10 90
		//ЦАП3
		440,440,		  //50 130
		//ЦАП4
		511,511			  //51 131
	};

	const byte PROG_POLL_SSP[]={
		2,42,82,122,
		3,43,83,123,
		4,44,84,124,
		5,45,85,125,
		6,46,86,126,
		12,52,92,132,
		13,53,93,133,
		7,47,87,127,
		8,88,48,128,
		9,89,
		49,129,
		10,90,
		50,130,
		51,131
	};
	#define CONTACT_POSITION 14
	//94 вторая пачка
//-------контактные параметры-----------------
	//Значения
	#define CONTACT_BDC 0x2AA


uint cur_word;
uint tick;
//uint mask[]={0xF,0xF0,0xF00,0xF000};
uint shifts[]={0,4,8,12}	 ;
#define S2A1	 ((BDC_USER_DATA_18[cur_word]>>shifts[tick])&0xF)
#define S2A2	 (((BDC_USER_DATA_18[cur_word]>>shifts[tick])&0xF)<<4)
#define S2A3	 (((BDC_USER_DATA_18[cur_word]>>shifts[tick])&0xF)<<8)
#define S2A4	 (((BDC_SERVICE_DATA_18[cur_word]>>shifts[tick])&0xF)<<12)

#define S1A1	 ((BDC_USER_DATA_16[cur_word]>>shifts[tick])&0xF)
#define S1A2	 (((BDC_USER_DATA_16[cur_word]>>shifts[tick])&0xF)<<4)
#define S1A3	 (((BDC_USER_DATA_16[cur_word]>>shifts[tick])&0xF)<<8)

#define STREAM1 S1A1|S1A2|S1A3
#define STREAM2 S2A1|S2A2|S2A3|S2A4

#define NEXT_TICK if(++tick==4){tick=0;if(++cur_word==20) cur_word=0;} 
#define CLEAR_TICK tick=0;cur_word=0;
#endif